cities_ = {
    '北京': '010000',
    '上海': '020000',
    '天津': '050000',
    '重庆': '060000',
    '广东': '030000',
    '江苏': '070000',
    '浙江': '080000',
    '四川': '090000',
    '海南': '100000',
    '福建': '110000',
    '山东': '120000',
    '江西': '130000',
    '广西': '140000',
    '安徽': '150000',
    '河北': '160000',
    '河南': '170000',
    '湖北': '180000',
    '湖南': '190000',
    '陕西': '200000',
    '山西': '210000',
    '黑龙江': '220000',
    '辽宁': '230000',
    '吉林': '240000',
    '云南': '250000',
    '贵州': '260000',
    '甘肃': '270000',
    '内蒙古': '280000',
    '宁夏': '290000',
    '西藏': '300000',
    '新疆': '310000',
    '青海': '320000',
}

parameter = {
        'api_key': '51job',
        'timestamp': '1681701772',
        'keyword': 'plc',
        'searchType': '2',
        'function': '',
        'industry': '',
        # 不同参数指定不同区域,这里指定了云、贵、川、渝
        'jobArea': '060000,090000,250000,260000',
        'jobArea2': '',
        'landmark': '',
        'metro': '',
        'salary': '',
        'workYear': '',
        'degree': '',
        'companyType': '',
        'companySize': '',
        'jobType': '',
        # 发布日期筛选
        'issueDate': '',
        'sortType': '0',
        'pageNum': '1',
        'requestId': '',
        # 可以直接指定爬取数据个数，经测试，最大值为20000
        'pageSize': '10000',
        'source': '1',
        'accountId': '',
        'pageCode': 'sou|sou|soulb',
    }

print(parameter['jobArea'])
print(cities_['北京'])
parameter['jobArea'] = cities_['北京'] + ',' + cities_['上海']
print(parameter['jobArea'])
